/************************************************************************************
					文件名：USBL.h
					最后一次修改时间：2025/7/2
					修改内容：无
*************************************************************************************/

#ifndef __USBL_H__
#define __USBL_H__

/************************************************************************************
 									包含头文件
*************************************************************************************/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <unistd.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <sys/ioctl.h>
#include <fcntl.h>
#include <errno.h>
#include <signal.h>
#include <termios.h>
#include <pthread.h>
#include <time.h>
#include "../../tool/tool.h"

 
/************************************************************************************
 									数据类型
*************************************************************************************/
typedef struct{
    char recvdata[64];                             //从USBL接收到的数据
}usblDataPack_t;

/************************************************************************************
 									函数原型
*************************************************************************************/
/*	外界获取文件描述符	*/
int USBL_getFD(void);

/*	初始化	*/
int USBL_Init(void);

/*	关闭	*/
int USBL_Close(void);

/*	读取/解析数据	*/
ssize_t USBL_ReadRawData(void);
int USBL_ParseData(void);

#endif
